In [2]:
import pandas as pd
import numpy as np

### Create a Series

In [3]:
# use list create a Series 
obj = pd.Series([4, 5, 8, 9])
obj

0    4
1    5
2    8
3    9
dtype: int64

In [5]:
# use dict create a Series 
data = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000} 
obj2 = pd.Series(data)
obj2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [6]:
# Series to dict
obj2.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

### Create a Dataframe

In [7]:
# a dict of lists 
data = {
     "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
    }

df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
# a dictronary of dictionaries 
populations = {
    "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
    "Nevada": {2001: 2.4, 2002: 2.9}
    }
df2 = pd.DataFrame(populations)
df2

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9